{"meta":{"title":"林的家","subtitle":"","description":"社恐内向 胆小敏感","author":"林","url":"https://rmlin.cn","root":"/"},"pages":[{"title":"","date":"2024-09-24T05:37:18.442Z","updated":"2024-09-24T05:37:18.442Z","comments":true,"path":"about/index.html","permalink":"https://rmlin.cn/about/index.html","excerpt":"","text":"在校大二生,普普通通的男大学生 处女座+infj"},{"title":"archives","date":"2024-09-13T04:13:10.000Z","updated":"2024-09-13T04:13:10.540Z","comments":true,"path":"archives/index.html","permalink":"https://rmlin.cn/archives/index.html","excerpt":"","text":""},{"title":"更新日志","date":"2024-09-24T02:48:34.000Z","updated":"2024-10-10T05:56:35.568Z","comments":true,"path":"更新日志/index.html","permalink":"https://rmlin.cn/%E6%9B%B4%E6%96%B0%E6%97%A5%E5%BF%97/index.html","excerpt":"更新日志，记录网站更新内容","text":"更新日志，记录网站更新内容 9.24 ​ 更新了文章的封面 ​ 更新了暗黑模式 ​ 更新了友链页面 ​ 更换了作者头像 ​ 增加了主页背景图 ​ 对博客文章内容进行了增改 9.25 更新了电脑端的live2D人物 “hibiki” 加入了新的主人翁“友人A” 更新了新的文章《A 的日常》 9.27 更新了新文章”奇怪的比赛赛题递归与非递归解题算法的研究“ 10.6 更新了A的日常 修复了文本错误 10.8 修复了滚动条重叠导致的显示错误 添加了鼠标点击爱心动画 删除文章右边栏上方图片和显示错误问题 新增光标样式 10.9 右键菜单增改 标题特效 修复了一些BUG 10.10 添加网站雪花飘落效果 浏览器网页标题恶搞 背景添加动态线条效果"},{"title":"我的朋友","date":"2024-09-23T10:32:38.493Z","updated":"2024-09-23T10:32:38.493Z","comments":true,"path":"friends/index.html","permalink":"https://rmlin.cn/friends/index.html","excerpt":"","text":"一起互换友链吧😃，快快联系我"},{"title":"所有分类","date":"2024-09-13T15:19:38.757Z","updated":"2024-09-13T15:19:38.757Z","comments":true,"path":"categories/index.html","permalink":"https://rmlin.cn/categories/index.html","excerpt":"","text":""},{"title":"所有标签","date":"2024-09-13T15:20:05.551Z","updated":"2024-09-13T15:20:05.551Z","comments":true,"path":"tags/index.html","permalink":"https://rmlin.cn/tags/index.html","excerpt":"","text":""},{"title":"","date":"2024-10-29T04:53:03.332Z","updated":"2024-10-29T04:53:03.332Z","comments":true,"path":"baidu_verify_codeva-F6AyET8949.html","permalink":"https://rmlin.cn/baidu_verify_codeva-F6AyET8949.html","excerpt":"","text":"layout:false a4be0180b0095f915773d515315e96f4"}],"posts":[{"title":"公告","slug":"公告","date":"2024-10-28T10:26:05.000Z","updated":"2024-10-28T10:34:46.970Z","comments":true,"path":"2024/10/28/公告/","permalink":"https://rmlin.cn/2024/10/28/%E5%85%AC%E5%91%8A/","excerpt":"","text":"关于消失的一个月 已经10月底了好快，网站的建立到现在已经经历了两个月。九月初花费了大量的精力打好基础时被许多琐事缠身无法脱身，现在又恰逢LOL世界赛，四级考试，考研学习，迷上了纸质的书记和漫画….. 总之就是忙的很，暂时暂停的网页的更新，但现在大部分大部分已经处理清楚了，所以打算继续更新，内容是关于个人情感的吐槽和c语言的学习，感兴趣可以蹲后续 — 10.28","categories":[{"name":"杂谈","slug":"杂谈","permalink":"https://rmlin.cn/categories/%E6%9D%82%E8%B0%88/"}],"tags":[]},{"title":"剧终抑郁症","slug":"剧终抑郁症","date":"2024-09-27T06:45:54.000Z","updated":"2024-10-10T05:37:09.957Z","comments":true,"path":"2024/09/27/剧终抑郁症/","permalink":"https://rmlin.cn/2024/09/27/%E5%89%A7%E7%BB%88%E6%8A%91%E9%83%81%E7%97%87/","excerpt":"你是否有过这种感觉，就是在即将看完一本书，一场电影，一部动漫时会莫名其妙的怅然若失五味杂陈。直到一切结束尘埃落定时，五味杂陈的情绪好像被嚼碎。此时的你肯定意犹未尽，想努力回忆故事的开始，细品结束的感动。但这时你会发现翻遍了一切，留下来的只有茫茫无边的寂寥感。那种感觉会噎的你喘不过气，会让你怀疑故事的真实，但同时会让人欲罢不能。于是我们就会翻找更多更多的故事，再去体验这种感觉……","text":"你是否有过这种感觉，就是在即将看完一本书，一场电影，一部动漫时会莫名其妙的怅然若失五味杂陈。直到一切结束尘埃落定时，五味杂陈的情绪好像被嚼碎。此时的你肯定意犹未尽，想努力回忆故事的开始，细品结束的感动。但这时你会发现翻遍了一切，留下来的只有茫茫无边的寂寥感。那种感觉会噎的你喘不过气，会让你怀疑故事的真实，但同时会让人欲罢不能。于是我们就会翻找更多更多的故事，再去体验这种感觉…… 首先我们从”追剧说起“ 你为什么刷剧停不下来因为在现实生活中，我们想要获得完美爱情和事业有成并不容易纵观周围，你会发现，每个人沉迷的剧类型都是不一样的。 虐恋剧、苦情剧、悬疑剧、职场剧、恐怖剧……每个人潜意识里的需要都不一样。 追剧停不下来，其实也是我们潜意识的一种“替代性满足”。 “替代性满足”就是当你的欲望能量，在最初对象上遇到阻碍时寻找一个替代对象，以消除紧张、满足欲望的心理现象。 比如，一个平时讨好不敢表达攻击性的女孩，却非常喜欢一些个性张扬、飞扬跋扈的角色。 追剧过程中，我们会想象自己是男女主，想要什么就有什么，而且影视创作者深谙观众心理，TA们知道那些情节会让观众获得快感、怎样设计剧情会让人上瘾。 精神分析理论中，弗洛伊德在《作家与白日梦》中提出了文学作品中存在的替代性满足：“每一个幻想都是一个愿望的满足”。 什么是剧终抑郁症？“剧终抑郁症”指的是一部好剧播完后的落寞感。你觉得没有这部剧可看的日子是多么的无聊而空虚。这种空虚和伤感通常在大结局播出时来袭。也许在该剧播完后几周甚至几个月你还郁郁寡欢。唯一的复原方法是找到下一步好看的电视剧或动漫。 影视剧行业总结过一些创作规律：女性观众喜欢看“王子爱上灰姑娘”的故事，男性喜欢看“草根逆袭成英雄”的故事。刷剧的过程虽然很爽，但很多人刷完会有中“虚空”的感觉： 破灭感 感觉生活没有了追求 看不进去一部新的剧 不断回想这剧情和情节 反复重看这部剧 疯狂在网上搜索这部剧的讨论和花絮 不断向身边的人安利这部剧 有人把这种感觉和“失恋”做等同，心理学上称之为“剧终后忧郁”。它不是抑郁症，而是一系列复杂的抑郁感受，与怀旧（nostalgia）和空虚（emptiness）都有共通之处。这种情形不仅仅出现在看剧后，在任何你深陷其中的事件完成后，都会产生这种空虚感。 比如，忙碌的婚礼结束了，期待很久的聚会结束了，准备了几个月的考研结束了……明明当时的自己挺开心，结束后却感觉很难过。 当你深陷情节中时，你的心对它是完全敞开的，你允许你的情绪随之起伏。但当这一切都结束是，你会觉得像是失去了一部分自我。从生理角度来说。导致这种情况的原因，是皮质醇和肾上腺素等激素水平的快速回落，让我们感受到不愉快。 我的理解”我们始终是旁观者，我们进入了别人的世界，看着他们的生活，开始浮想联翩，当回过头来时，发现你的旁观时间已经到了，你不得不走，这时，你会对这些感到留念，觉得要是自己也能这样该多好，你需要说再见，对自己过去的年华说再见“ 观众之所以是观众，因为我们无法去改变故事的走向，无法更改既定的结局。当终点到来时，故事里的他们将停留在那一刻，而我们则要继续向前，离他们而去，这就是为什么我会感到怅然若失的原因。 本人也患有过严重的剧终抑郁症，从一开始不敢看到后面一口气追完全部，看完后意犹未尽，开始在网上看有没有剧场版，有没有番外，有没有小说，有没有漫画；再在各个平台搜作者，搜番剧的讨论，会在这些讨论中一遍遍回味剧情，会扣细节等等以祢补心中那不知为何的空虚。只不过经历了高中三年间断看番，导致“病情”缓解并没有。现在重新看完一部番仍会意犹未尽……. 因为在二次元里面，没有三次元的复杂关系，是最单纯善良的地方，对我来说，二次元并不是逃离现实，而是对现实有新的憧憬。这是父辈们所不能理解的存在，这也很好的解释了 为什么”吃谷人“盛行。有人说二次元的钱好赚，我承认是如此，但二次元们买谷不仅仅是热爱，更多的是情怀，对一个角色性格的喜欢，喜欢ta的方方面面，这是一种精神力量。我想掌握好这种力量可能也不为是一种方式，去激励着人们前行。我可能直到结婚生子还是会去接触番剧，每当接触一部好的番剧时，我都会有新的感悟和理解，我想它为什么不能被称为一种新的”书籍“,纸质书、电子书以外的第三种“书”。它并不“坏”，我们也不应对这种行为感到可耻，大胆去爱！","categories":[{"name":"杂谈","slug":"杂谈","permalink":"https://rmlin.cn/categories/%E6%9D%82%E8%B0%88/"}],"tags":[{"name":"感情","slug":"感情","permalink":"https://rmlin.cn/tags/%E6%84%9F%E6%83%85/"},{"name":"林","slug":"林","permalink":"https://rmlin.cn/tags/%E6%9E%97/"}]},{"title":"蓝桥杯递归与非递归解题算法的研究","slug":"蓝桥杯递归与非递归解题算法的研究","date":"2024-09-27T01:00:52.000Z","updated":"2024-09-27T03:28:28.098Z","comments":true,"path":"2024/09/27/蓝桥杯递归与非递归解题算法的研究/","permalink":"https://rmlin.cn/2024/09/27/%E8%93%9D%E6%A1%A5%E6%9D%AF%E9%80%92%E5%BD%92%E4%B8%8E%E9%9D%9E%E9%80%92%E5%BD%92%E8%A7%A3%E9%A2%98%E7%AE%97%E6%B3%95%E7%9A%84%E7%A0%94%E7%A9%B6/","excerpt":"蓝桥杯大赛由工业和信息化部人才交流中心主办，国信蓝桥教育科技（北京）股份有限公司承办，是高校教育教学改革和创新人才培养的重要竞赛项目。经过多年的发展，蓝桥杯大赛吸引了包括北京大学、清华大学、上海交通大学、复旦大学、南京大学、哈尔滨工业大学、北京航空航天大学、北京理工大学、四川大学、华中科技大学、华东师范大学、华南理工大学等知名院校在内的1400多所高校参与，参赛选手总数已经超过30万人，成为国内首屈一指的IT类专业赛事。研究了一道填空题的两种解法，以供同行参考","text":"蓝桥杯大赛由工业和信息化部人才交流中心主办，国信蓝桥教育科技（北京）股份有限公司承办，是高校教育教学改革和创新人才培养的重要竞赛项目。经过多年的发展，蓝桥杯大赛吸引了包括北京大学、清华大学、上海交通大学、复旦大学、南京大学、哈尔滨工业大学、北京航空航天大学、北京理工大学、四川大学、华中科技大学、华东师范大学、华南理工大学等知名院校在内的1400多所高校参与，参赛选手总数已经超过30万人，成为国内首屈一指的IT类专业赛事。研究了一道填空题的两种解法，以供同行参考 赛题内容题目名称，奇怪的比赛。题目大意如下：某电视台答题类比赛。计分规则如下：参赛选手每人需要回答10个问题（其编号为1到10），题号越往后，难度越大。答对的，当前分数翻倍；答错了则扣掉与题号相同的分数（选手必须回答问题，不回答按错误处理）。每位选手都有一个起步的分数为10分。某获胜选手最终得分刚好是100分，如果不让你看比赛过程，你能推断出他（她）哪个题目答对了，哪个题目答错了吗？如果把答对的记为1，答错的记为0，则10个题目的回答情况可以用仅含有1和0的串来表示。例如：0010110011 就是可能的情况。 你的任务是算出所有可能情况。每个答案占一行。多个答案顺序不重要。 审题审题很关键，总共就10题，每道题必须解答，如果答对分数乘以2，答错扣掉当前题号对应的分值。首先得研究答题情况0010110011时，为什么得分是100分。答题前的初始分数是10分，根据题目中的测试用例，用例的得分过程如表1所示。 从上表可以清晰地看到答题得分的具体情况，为后面写程序奠定基础。 递归思路解题递归总共调用10层，到第十一层就停止。设计递归的出口和形式。递归函数名取作competition，参数设两个，一个是待打题号step，一个是分数sum递归函数声明为void competition (int sum,int step)。递归的答题调用情况如图1所示。 递归解法的完整代码如下： 123456789101112131415161718192021222324#include &lt;iostream&gt;using namespace std;int ans[12];void competition(int sum,int step)&#123;if(step==11)&#123; if(sum==100)&#123; for(int i=1 ;i&lt;11 ;i++)&#123; printf(&quot;%d&quot;,ans[i]); &#125; puts(&quot;&quot;); &#125; &#125;else&#123;ans[step]=0;competition (sum-step,step+1); //错ans[step]=1;competition (sum*2,step+1); //对 &#125;&#125;int main()&#123;competition (10,1);return 0;&#125; 非递归暴力穷举法解题 用整形数组表示答题情况，在 main 函数中声明数组 chardati[12]，其中dati[0]不使用，dati[11]也不使用，用dati[1]~dati[10]依次存储答题标记，’0’表示答错，’1’表示答对。有学生用十层循环的嵌套来穷举所有的答题情况，而本论文的思路是先研究十位无符号二进制的表述范围0~1023，将访问到的十进制值转化为二进制，十进制转二进制（10位）的流程图如图2所示，数组的使用是关键。然后是根据答题得分规则写得分判断函数。参考表1，设计计算得分函数如下所示。 1234567891011121314151617181920212223242526272829int getResult(char *bn)&#123; int score=10; int i; for(i=1;i&lt;=10;i++) &#123; if(bn[i]==&#x27;0&#x27;)score=score-i; else if(bn[i]==&#x27;1&#x27;)score=score*2; &#125; return score;&#125;最后设计主函数main，代码如下：int main()&#123; char dati[12]; int score; int num; score=10; for(num=0;num&lt;=1023;num++) &#123; change(dati,num); score=getResult(dati); if(score==100) &#123; print(dati); printf(&quot;\\n&quot;); &#125; &#125;&#125; 最后，运行程序，结果如图3所示 如此，题目已经解答正确。 结束语蓝桥杯程序竞赛近年来得到越来越多的关注，每年有接近上万的选手参赛，如何辅导选手更好地发挥所长取得成绩，需要不断地研究赛题，本文只是针对一道填空题的递归和非递归解法做示范，希望能给同行参考。未来将更多地关注难度更高的赛题议。","categories":[{"name":"笔记","slug":"笔记","permalink":"https://rmlin.cn/categories/%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"c++","slug":"c","permalink":"https://rmlin.cn/tags/c/"},{"name":"笔记","slug":"笔记","permalink":"https://rmlin.cn/tags/%E7%AC%94%E8%AE%B0/"}]},{"title":"A 的日常","slug":"A 的日常","date":"2024-09-25T06:48:25.000Z","updated":"2024-10-29T04:40:27.268Z","comments":true,"path":"2024/09/25/A 的日常/","permalink":"https://rmlin.cn/2024/09/25/A%20%E7%9A%84%E6%97%A5%E5%B8%B8/","excerpt":"前言A 躺在床上睡不着，突然想明白了一件事，我是会死的。也许是10年后，也许是30年后，也许是50年后，谁知道呢？反正是有这么一天的，然后这个世界上会没有我任何存在过的痕迹。这一刻ta突然顿悟了，什么面子，什么压力，全都不重要了，好轻松，无比的通透。此刻看着天上的星星，突然觉得好感动，”以后的每一天我都要过的很开心，因为，除了活着，其他的什么都不重要了”。说罢便安心睡下了:sleeping:","text":"前言A 躺在床上睡不着，突然想明白了一件事，我是会死的。也许是10年后，也许是30年后，也许是50年后，谁知道呢？反正是有这么一天的，然后这个世界上会没有我任何存在过的痕迹。这一刻ta突然顿悟了，什么面子，什么压力，全都不重要了，好轻松，无比的通透。此刻看着天上的星星，突然觉得好感动，”以后的每一天我都要过的很开心，因为，除了活着，其他的什么都不重要了”。说罢便安心睡下了:sleeping: 前传A 是一个普普通通的高中生，或许那晚对人生的思考就是他出生以来做过的最伟大的事件了。他每天上学期待的莫过于午餐和晚餐的定夺啦！虽然学习成绩不行却对学校食材有着顶级理解，他喜欢在最后一节课后疯跑，那是他最快乐的时光。或许是坐在第一排的原因，A总是能在抢饭者中位列前茅。他是那么自豪比别人多出这么多时间，可以最快的吃饭然后回到宿舍开始学习。可A并不开心，因为回到教室后看到有人不吃饭在学习，他很害怕，害怕被超越、害怕被拉下……于是他也开始不吃饭学习，但新的麻烦却出现了。“拉呱姐”在经历一天繁重的课程后唯一有时间聊八卦也只有现在了，A开始烦周围的环境，怪别人聊天会影响他的学习，A自顾自的跑出教室其寻找“一方净土”。（可为什么其他学习的人不受影响呢？）寻求自我安慰？也许吧，具体的情况可能只有A自己知道。 A总是找着各种理由，他不愿意承认自己的不足，把所有问题归咎与环境与他人，所以最后的最后他也没有考上心仪的大学，回想高一的信誓旦旦再看看自己的处境，他的朋友曾开玩笑的对他说：“不会三年后，让我知道你在一个三本吧” 是的，这句话灵验了又好像没有，因为他的朋友始终不知道A去了哪里。“不告诉别人他就不知道了吧！”A自以为是的说道“ 这句话不算灵验“。 可他却中了另一条”我觉的你好像啊Q”，这是上高二时另一位故人对他说的话，那时候的他就已经学会了自我欺骗的精神胜利法了。 最可悲的是A直到现在还在用着精神胜利法自我欺骗着…… 2023-2024上半年A看似很忙也拿到了很多荣誉和奖项，但你如果去问A学会了什么？ta会告诉你-——nothing。这些奖项在升学上没有帮助，在求职上也毫无建树，只是为了少许学分绩点拼命着打比赛（到最后因为成绩不突出也没拿到奖学金&#x2F;(ㄒoㄒ)&#x2F;~~） 在情感方面，A追过两个女孩都失败了，于是乎A去算了一卦。直到有一天神婆说在大学期间学业和爱情只能择其一，A眉头一皱心一狠”果然只能抛弃爱情了呢”。但A在爱情方面并不是一无所获，或许是巧合ta前后看了一本书和一部电影，《月亮与六便士》和《花束般的恋爱》，对爱情有了新的理解和定义。”月亮很美好，但地上的便士更加重要”，随着A学历和阅历的提升他的眼界会变高，会遇到更优秀的女孩子，稳定的工作收入才是爱情有力的保障，或许A错过了一段轰轰烈烈的大学爱情，但ta不后悔并为此努力着。 2024 下半年今年是A上大学的第二年，勉强成为了一个“合格”的大人，学会了自我反省和尝试中试错。Scanning past life to see future，A发现了自己的定位并为此奔波努力ing ，而他最近的一个目标就是十二月份的四级考试。Fighting！！！","categories":[{"name":"路人A","slug":"路人A","permalink":"https://rmlin.cn/categories/%E8%B7%AF%E4%BA%BAA/"}],"tags":[{"name":"路人A","slug":"路人A","permalink":"https://rmlin.cn/tags/%E8%B7%AF%E4%BA%BAA/"}]},{"title":"情感的本质","slug":"情感的本质","date":"2024-09-24T05:37:48.000Z","updated":"2024-09-25T07:37:30.733Z","comments":true,"path":"2024/09/24/情感的本质/","permalink":"https://rmlin.cn/2024/09/24/%E6%83%85%E6%84%9F%E7%9A%84%E6%9C%AC%E8%B4%A8/","excerpt":"情感是人们对客观事物是否符合自身需要而产生的内心体验，它是一种心理现象，包括喜怒哀乐、爱恨惊惧等。情感心理学主要研究情感发生、发展、变化的心理规律。根据情感发生的强烈程度、持续时间的长短、情感的稳定性和方向性，情感可以分为心境、激情和应激 情感的发生伴随着多种生理变化，如心率加快、呼吸急促、血压升高、面部表情肌肉运动等。这些生理变化是由大脑边缘系统、下丘脑、脑干网状结构等部位的中枢活动所引起的。这些生理机制对于情感的表达和调节具有重要的作用。 情感与认知是相互关联的，情感是基于认知的，同时又对认知产生影响。情感体验会影响人的认知判断和决策，同时认知过程也会影响情感的表达和调节。例如，积极的情绪可以提高人的注意力和记忆力，而消极的情绪则可能导致认知功能下降。 一条河流曲曲弯弯，前进、后退、迂回，却总是到达要去的地方。 —奥克塔维奥·帕斯-","text":"情感是人们对客观事物是否符合自身需要而产生的内心体验，它是一种心理现象，包括喜怒哀乐、爱恨惊惧等。情感心理学主要研究情感发生、发展、变化的心理规律。根据情感发生的强烈程度、持续时间的长短、情感的稳定性和方向性，情感可以分为心境、激情和应激 情感的发生伴随着多种生理变化，如心率加快、呼吸急促、血压升高、面部表情肌肉运动等。这些生理变化是由大脑边缘系统、下丘脑、脑干网状结构等部位的中枢活动所引起的。这些生理机制对于情感的表达和调节具有重要的作用。 情感与认知是相互关联的，情感是基于认知的，同时又对认知产生影响。情感体验会影响人的认知判断和决策，同时认知过程也会影响情感的表达和调节。例如，积极的情绪可以提高人的注意力和记忆力，而消极的情绪则可能导致认知功能下降。 一条河流曲曲弯弯，前进、后退、迂回，却总是到达要去的地方。 —奥克塔维奥·帕斯- 情感的定义心理学把情感定义为：“人对客观现实的一种特殊反映形式，是人对于客观事物是否符合人的需要而产生的态度的体验”。从这个定义可以了解到：情感是一种主观体验、主观态度或主观反映，属于主观意识范畴，而不属于客观存在范畴。 “人对于客观事物是否符合人的需要”实际上是一个典型的价值判断问题，“符合人的需要”就是事物的价值特性，是一种客观存在，“态度”和“体验”均是人对事物的价值特性的认识方式或反映方式，这样，心理学的情感定义又可表述为：“情感是人对事物的价值特性所产生的主观反映”。情感所对应的客观存在应该是事物的价值特性。 情感是人脑对于价值关系的主观反映，那么情感的大小也必然取决于主体、客体和介体三者的品质特性，这就是“情感的三要素”。 根据情感主导变量的不同，人的情感可分为欲望、情绪与感情三种类型。 欲望 ​ 当主导变量是人的品质特性时，人对事物所产生的情感就是欲望。当机体缺乏食物时，人就会产生饥饿的心理体验，并形成对于食物的欲望。是人的本质，因为他的本质被认为是由任何给定的自身情动所决定的任何行动 情绪 ​ 当主导变量是环境的品质特性时，人对事物所产生的情感就是情绪。例如，脏、乱、差的工作环境使人产生不愉快的情绪。 感情 ​ 人的生存与发展要核心内容上就是对于价值的生产与消费，那么，情感对于人类的意义就是：人类依靠情感来识别价值、表达价值、区分价值、计算价值、选择价值和创造价值。 情感的脆弱与坚韧情感，这个看似无形却强大无比的力量，既能让两个陌生人迅速靠近，也能在瞬间将最亲密的关系推向深渊。它的脆弱，在于一旦受到伤害，即便是最细微的裂痕，也可能成为无法愈合的伤口；而它的坚韧，则在于那些历经风雨依然坚守的情感，如同磐石般坚定不移。然而，当人心寒了，这份坚韧似乎也变得脆弱不堪，因为寒心，往往源于信任的崩塌和期望的落空。 什么是脆弱？（自我逃避） ​ 在Anna Bruk等人（2018）看来，脆弱（vulnerability）是指：尽管有恐惧，但仍然愿意对不确定性和风险持开放态度，愿意暴露自己的情感。它意味着我们不害怕被拒绝，愿意放弃对自身全然的控制，把自己放在一个被动的、充满风险的位置。我们谈论脆弱的时候，谈论的是一种没有防御或者防御程度低的生活。 脆弱的人是敞开的，不以“活得安全”作为人生的信条，ta们愿意进行尝试，迎接来自外界的所有回应，即便得到的是拒绝；脆弱的人不害怕伤害，愿意面对自己的所有面向，容忍自己的挫败和丧失，而不是把令人痛苦的感觉隔离开来。在ta们看来，感知伤害是人生的一部分，在被伤害后能够涵容痛苦，继续拥抱生活，同样是人生的一部分。**脆弱是朝向适应现实的，对个人的发展有极重要的意义。 但是，我们常常回避脆弱（放弃） ​ 尽管我们需要脆弱，但常见的情况是，我们将脆弱与恐惧、羞耻、悲伤和失望等黑暗情绪（dark emotions）联系在一起，即使它们深刻地影响了生活、爱和工作方式，这些情绪我们也不想讨论。 ​ 比如，不敢率先承认自己对他人的爱，因为这看起来像是放弃了自己对这段关系的控制权，有着被拒绝的可能；不敢在工作中说出自己面临的困难，因为这意味着无能；不敢表露自己对某件事情的恐惧和悲伤，因为这代表着软弱和矫情。 ​ 在现代社会中，脆弱依然被看作需要隐藏和规避的情感，需要将其从我们的经验世界中清除掉。尤其对男性来说，在男子气概中，脆弱往往被认为是缺点，而不是美德。 ​ 情况在今天变得更加复杂，不论男女，更被社会认可的气质是坚强、果敢，流露脆弱不仅可能会被看作“软弱”，还有“装可怜”之嫌。 ​ 这也与我们的防御有关。我们生活在一个随时都可能被伤害的世界，为了避免某些伤害，发育出了许多自我防御机制。脆弱带来的痛苦，常以这种方式被我们隔离掉。 ​ 因此，脆弱是珍贵的。 ​ 在回避脆弱的过程中，我们变得自我封闭。当我们把痛苦隔绝在心门外的时候，我们也把一切新鲜事物发生的可能性、把所有可能改变我们当下状态的美好事物的发生，一起阻挡在了自身以外。 如何做到保持脆弱？ ​ 当一个人是脆弱的，ta对他人就可以有更好的共情——因为ta们不害怕体会到情感，也更能理解他人深深埋藏起来的脆弱和痛苦。因此ta们对待他人更为仁慈。 ​ ta们欢迎未知的可能性，准备好了承受生活中的各种遭遇，是因为ta们更有勇气、更相信自己，也是因为一种“无论欢喜悲伤，都是生而为人的珍贵体验”的人生价值观。 ​ 这种脆弱的本质，是对待自我、他人和世界的深深的敞开——一种允许新事物发生发展的人格开放性，最终因为开放，你迎接了变化的发生，从而走向了自我的康复。 关于如何做到保持脆弱，把“向着万事万物深深敞开自己”作为一种生活态度，你可以尝试以下几点： ​ 自爱。如果不能够爱自己，不愿意看一看自己真实的需求、不愿意承认自己的痛苦、不相信自己的欲望和感受是重要的，你的敞开就无从说起。你对生活的感受，就会很容易被社会的评价影响。 ​ 接纳。接纳自己不可能控制一切、接纳他人有着和自己一样的人性的复杂性。这种接纳会让你放下高的预期，从而更平和地看待生活。 ​ 有意识地放弃一部分生活中的防御。不畏惧痛苦，认识到它是生而为人的一部分、甚至是一种特权。认识到自己随时可能受到伤害的现实，同样，也认识到自己有能力处理痛苦。只有放下防御，我们才是敞开的，新的事物才能刚好地走进我们。 掌控意味着已知，允许意味着未知。要想生活发生改变，获得新的可能，必须承受风险、放弃掌控、让自己意外——我们无法预知是好的可能还是坏的可能，我们只能向万事万物深深地敞开自己。 以开放的态度对待生活并不容易，但也正因其艰难而显得更有价值。有些人想躲避艰难，封闭内心来阻隔焦虑和压力，但这是对真实情绪和感受的压抑，长此以往会损害身心健康。我们必须敞开身心，与自己对话、与真实的世界互动，才能成为心理灵活性更强的人。 不过，走向开放、接纳脆弱是一个过程。也就是说，这不意味着完全否定当下的防御机制，也不意味我们要立刻“开放”，当我们意识到自己难以承受的时候，依然可以有选择地退回到安全领域，逐渐消解自身的痛苦。 但最终，如果想过更有可能性的生活，让更新和更好的事物在我们体内发生，就要求我们必须看到脆弱的珍贵与美好，望向面前的另一条路径：从安全领域走出，以开放而脆弱的状态迈向这个世界，从而过上更为丰盈的人生。 情感的博弈与均衡背叛与忠诚和信任是相对应的，而理解和信任才是情感和家庭关系的根基。前文所述只不过是在简单地假设条件下，将经济学原理运用于背叛预期的分析，基本上只是揭示了问题。考虑到夫妻或者伴侣双方的直接互动，接下来我们可以通过引入博弈分析来部分地解决问题。之所以说是部分地解决，是因为现代经济学中的效用分析和效率观点是不完善的，它缺乏或者说丧失了心理学的根基。例如Sen批评“理性人假设”将人看成了“理性的傻瓜”；Kahneman在谈到理性假设时说“除理性之外，人类的行为都是有目的的”。另外，自边际效用学说之后，序数效用表达偏好排序回避了效用的人际比较问题，而在考虑福利影响时这一问题又是无法回避的。 设想一种情境，其中双方都面临“忠诚”和“背叛”两种选择。如果双方都忠诚并情愿付出则情感和谐（尽管其直接表现为负所得），仅一方付出则另一方属于“搭便车”者（free-rider），双方都不付出则婚姻是失败的，所得皆为0。下图是为支付矩阵，其中数字可理解为投入时间价值：0 可以看出，双方的占优策略都是“背叛”，它与“囚徒困境”相似，但不同的是使双方收益（并非最终效用）最大化的策略并非是双方做出一致选择，而是只要有一方“忠诚”。这里需要先说明两点：一是此处的收益应是直接收益，将时间投入到家庭中属于对家庭的“奉献”，尽管最终会带来自身的收益，但仍先是直接体现为自身的付出；二是双方都选择“忠诚”仍是最值得追求的，因为家庭关系的和谐需要双方进行“合作”，才能取得互补收益并实现家庭效用的最大化。接受这两点，我们再考虑一方“忠诚”而另一方“背叛”的问题，它实际上表达了一种“调适”的理念。我们不主张丈夫或妻子持有传统的“三从四德”观念，即使对方不忠也甘愿奉献和牺牲自我。然而，家庭的组建和解散都是需要成本的，同时家庭幸福是需要不懈努力来追求的，如果一味坚持自身利益优于家庭利益和所谓的“平等”观念，最终可能不会得到家庭幸福。 与此类似，“性别战”是个博弈论中众所周知的例子。如果按照经济学的效率和最优化观点，双方都做自己最喜欢的事可以各得其所。然而，这里忽略了从对共同刺激有共同的反应中所获得的乐趣。所以，可能最好的办法是双方共同去做同一件事，然后得到真正最好的结果。另外，如果将家庭在个人的生命周期中视为是永续存在的，那么从双方博弈的角度来说，它应当是无限次重复博弈。由于无限次重复博弈中的最优策略永远都是“针锋相对”，这也给“合则两利”提供了充分的理由。 世界上有任何人都没有见过的东西， 它很温柔， 非常甜美 。大概如果可以看见的话 ，谁都会想要的吧。 正因为如此 ，才会谁也没有见过它， 为了让人无法那么轻易地得到， 世界才把它藏了起来 。但是总有一天会有人找到 ，应该得到的那个唯一的人 ，一定能把它找出来。 ——《龙与虎》 爱情动漫诗词摘录——致年少的青春 山内有樱名为良， 树本无名只待春； 樱花生在深山内， 春树志向贺新春； 樱花易逝，春树常青。 ———《我想吃掉你的胰脏》 音无结弦之时， 跃动天使之心； 立于浮华之世， 奏响天籁之音； 升起立华乐独奏， 曲终音无心结弦。 ” ———《天使的心跳》 “未闻花名，但识花香； 已知花名，花已不在； 再识花时，泪已千行。 ” ———《未闻花名》 引用： 情感的本质|Chen (reschen.cn) 背叛预期与感情危机——基于心理经济学分析 (cnki.net) 情感的哲学本质_百度百科 (baidu.com) 如何理解「脆弱是非常珍贵的一面，甚至是最美好的部分」？ - 知乎 (zhihu.com)","categories":[{"name":"杂谈","slug":"杂谈","permalink":"https://rmlin.cn/categories/%E6%9D%82%E8%B0%88/"}],"tags":[{"name":"感情","slug":"感情","permalink":"https://rmlin.cn/tags/%E6%84%9F%E6%83%85/"},{"name":"林","slug":"林","permalink":"https://rmlin.cn/tags/%E6%9E%97/"}]},{"title":"我的第一篇blog","slug":"我的第一篇blog","date":"2024-09-12T16:00:55.000Z","updated":"2024-10-06T13:15:36.800Z","comments":true,"path":"2024/09/13/我的第一篇blog/","permalink":"https://rmlin.cn/2024/09/13/%E6%88%91%E7%9A%84%E7%AC%AC%E4%B8%80%E7%AF%87blog/","excerpt":"Hello World!","text":"Hello World! 1.生日记录篇 收到了很多很多人的祝福，好开心！ 遇到了有趣的人！ 我们真的需要一些勇气，一些爱的勇气，一些不爱的勇气。 keep loving 张三的画好看的嘞，要是我也能画出这种的就好了 ​ 初中倒是画了些，也买了马克杯，勾线笔…… 但总的来说，被中式教育遏制住，兴趣被扼杀。仔细想想学生时代除了打游戏就没啥爱好，得亏钢琴吉他学的早，不然真泯然众人已。不过现在到也是一个什么也不行的半吊子吧，习没学好，游戏没打爽，女朋友没谈上，钱包还空空！😐 2.去年的随笔 《云端向往的两人》 ​ 当我们抬头仰望天空，目光常常被那些洁白无瑕、悠然自得的云朵所吸引。它们犹如天空的精灵，变幻着形状，漫舞在蔚蓝的天幕上。它们是自然界的魔法师，用它们千变万化的姿态，向我们展示了大自然的神秘与魅力。 ​ 与他邂逅是在一个明媚的下午，长久低头让我不免疲倦，抬头望向远方，一个男生出现在我视线中，操场上只有他一个人躺着，与周围玩耍的人群格格不入，顺着他的目光看去，天空中有一朵盛开的花，边缘稀薄的云层在太阳的透视下呈现出橙黄色，碎云点缀在花的四周宛如烟花盛开，我深深被这副景象吸引……这是我从未见过的景色。 ​ 第一次见到她是在一个晴朗的下午，我躺在操场上看云，远处有一只火烈鸟形状的云,我盯着感受它的移动一点一点的移动，不经意间一瞥，有一个女生坐在看台上，手中不时写着什么，我看着她认真的样子，我的心里仿佛长满了玫瑰，有岩石、篝火，还有爱人日落与晚霞，从见到她的时候更加生生不息。回过神时火烈鸟已经消失在天际，却留下一朵盛开的花。 ​ 云朵轻轻飘过，两颗心在这虚幻的境地相对而望。他们是命运的牵引，是爱情的缠绕。 ​ 我慢慢开始对这个女生产生好奇，我可能得了什么怪病，在望向天空时，每一朵云好像都是她的身影。感觉很熟悉却又想不起来，是我曾失去了的很重要的东西。 ​ 我慢慢开始对这个男生产生好奇，在读书写字时，那朵盛开的花和他的身影时不时出现在我脑海里，我想我大抵是病了，得了一种很奇怪的病。它如同一杯苦咖啡，那种苦涩而浓烈的滋味让人无法忘怀，而且会随着时间的推移而变得更加深刻。 ​ 我想——再见他（她）一次！只有她（他）才能治好我。 ​ 那是在霞光眩目的傍晚，云很多，我感觉他一定会来。对着镜子用饼粉打底、眉笔勾勒出卧蚕的形状、遮瑕轻轻涂抹在鼻翼两侧、腮红顺着脸颊慢捻……我以自己最满意的妆容和装扮去见他。操场上的人不多，但即使我站在看台上使劲张望却也看不到他的身影……一道道霞光像条条河流汇聚在天际，走下看台，心中卷起层层涟漪。 ​ 在晚霞的余晖下，一位少年穿过拥挤的人群奔跑。他的黑色发在微风中飞舞，身上白色的运动衫也被晚霞染成了橙黄。那片渐渐消退的晚霞如同一幅色彩斑斓的油画，将整个天空点缀得美轮美奂。从西方柔和的粉红色渐变为橙黄色，像是宇宙的云彩在不断变幻。悠扬的鸟鸣声回荡在空中，像是在鼓励少年勇往直前。在少年急促的呼吸声中，他回想起来了那个女孩，那个心中的白月光。 拥挤的人群中，两人四目相对，他们相遇了。 ​ “我……” ​ “我喜欢你！”男孩喘着说到“图书馆你认真的样子让我浪荡的生涯变轨，我立下誓言跟随你的脚步去追求属于我的天空，而你就是我的云”。 ​ ps: 去年看了芥川龙之介的《竹林中》，特别喜欢他的多视角描写。关于女子妆容描写有待争议，不太懂。。。 高中倒是有女生教我认口红色号，什么牛血、砖红、水蜜桃、葡萄红,叠涂什么的好难！😐","categories":[{"name":"杂谈","slug":"杂谈","permalink":"https://rmlin.cn/categories/%E6%9D%82%E8%B0%88/"}],"tags":[{"name":"林","slug":"林","permalink":"https://rmlin.cn/tags/%E6%9E%97/"}]}],"categories":[{"name":"杂谈","slug":"杂谈","permalink":"https://rmlin.cn/categories/%E6%9D%82%E8%B0%88/"},{"name":"笔记","slug":"笔记","permalink":"https://rmlin.cn/categories/%E7%AC%94%E8%AE%B0/"},{"name":"路人A","slug":"路人A","permalink":"https://rmlin.cn/categories/%E8%B7%AF%E4%BA%BAA/"}],"tags":[{"name":"感情","slug":"感情","permalink":"https://rmlin.cn/tags/%E6%84%9F%E6%83%85/"},{"name":"林","slug":"林","permalink":"https://rmlin.cn/tags/%E6%9E%97/"},{"name":"c++","slug":"c","permalink":"https://rmlin.cn/tags/c/"},{"name":"笔记","slug":"笔记","permalink":"https://rmlin.cn/tags/%E7%AC%94%E8%AE%B0/"},{"name":"路人A","slug":"路人A","permalink":"https://rmlin.cn/tags/%E8%B7%AF%E4%BA%BAA/"}]}